// const _posts = [
//   { id: 1, title: '게시글1', writer: '작성자1', content: 'test' },
//   { id: 2, title: '게시글2', writer: '작성자2', content: 'test' },
//   { id: 3, title: '게시글2', writer: '작성자2', content: 'test' }
// ]
const recommendedItems = [
  {
    subject: '이재용 레전드.jpg',
    key: 1,
    id: '어읏썸',
    date: '2018-09-26 11:24:47',
    reply: 65,
    content: 'ㅋㅋㅋㅋㅋ',
    img: require('@/assets/395f9bdc8d7d.jpg')
  },
  {
    subject: '뉴욕에서 벌어진 일본의 졸렬함.jpg',
    key: 2,
    id: 'kyss',
    date: '2018-09-26 11:27:30',
    reply: 61,
    content: '아베는  지지자들이 없어서 기분이 나쁜가보네요. 졸렬한새X들',
    img: require('@/assets/39cbd3d42c4d.jpg')
  },
  {
    subject: '어지간하면 야동 지우지마세요',
    key: 3,
    id: '윈터어게인',
    date: '2018-09-26 10:40:25',
    reply: 67,
    content: '진짜 다시 보고 싶은 그것이 그것의 그거 품번이 전혀 생각이 안납니다.',
    img: require('@/assets/36fa392bdc95.jpg')
  },
  {
    subject: '벌써 질투받는 97년생 SBS신입 아나운서.jpg',
    key: 4,
    id: '루차',
    date: '2018-09-26 12:37:23',
    reply: 102,
    content: ' ',
    img: require('@/assets/3d566e6f8aa0.jpg')
  },
  {
    subject: '문통 워딩도 강하고 시원시원졌네요 ㅋㅋㅋㅋㅋㅋㅋㅋ.gisa',
    key: 5,
    id: '브라흐마',
    date: '2018-09-26 10:01:56',
    reply: 40,
    content: `-- 일각에서는 대통령님께서 언론과 탈북민들을 탄압하고 의사 표현의 자유를 억압하고 있다는 이야기가 나옵니다.



▲ 아마도 한국의 역사상 지금처럼 언론의 자유가 구가되는 시기는 없었다고 생각합니다. 심지어 가짜뉴스라고 할 수 있을 정도의 왜곡된 비난조차도 아무런 제재 없이 언론이나 SNS 상으로 넘쳐나고 있고, 매주 주말이면 제 집무실 근처에 있는 광화문에 끊임없이 저를 비판하는 집회들이 열립니다. 제가 집무하는 청와대 앞길에서도 그런 식의 집회나 농성은 끊이지 않습니다. 북한을 떠나 한국으로 찾아오는 타국민을 우리는 언제든지 환영하며 우리 국민으로서, 또 동포로서 대하고 언젠가는 그 분들이 남북통일에 있어서 마중물이나 접착제 같은 역할을 할 것이라고 믿습니다.







-- 대통령께서 통일을 위해서 북한 편을 들고 있다는 이야기들이 있습니다. 민주주의 원칙에 반해서 교과서에서 관련 내용들을 삭제하고, 또 트럼프 대통령님의 표현을 빌자면 이 모든 것을 페이크 뉴스라고 말씀하고 계신데.



▲ 우선은 북한과의 관계 개선이나 통일을 지향하는 것은 역대 어느 정부나 같습니다. 북한과 평화통일을 이뤄야 한다는 것은 우리의 헌법에 규정된 대통령의 책무이기도 합니다. 방금 그렇게 비난했던 분들은 과거 정부 시절 통일이 이루어진다면 그야말로 대박이고 한국 경제에 엄청난 기회가 될 것이라고 선전했던 바로 그 사람들입니다. 정권이 바뀌니까 정반대의 비난을 하는 것입니다.









예전에는 두리뭉실하게 반박했을텐데, 이제는 거침 없네요

자신감도 느껴지고, 무엇보다 역대급 탱커가 공격수 역할도 하는 것 같네요

ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ`
  },
  {
    subject: '(펌) 곧 다가올 그날.jpg',
    key: 6,
    id: '퀘스트바이',
    date: '2018-09-26 15:22:25',
    reply: 66,
    content: '항의하시는 분, 불편하신 분들이 있어 내용 펑 합니다.'
  },
  {
    subject: '문재인 대통령, 미국 Fox News ‘스페셜리포트’ 와 인터뷰',
    key: 7,
    id: 'ninja7',
    date: '2018-09-26 11:04:51',
    reply: 44,
    content: `대통령이 출연하게 될 ‘스페셜리포트’는 폭스의 정치부문 선임 앵커인 브렛 베이어가 진행하는 폭스의 간판 프로그램으로 미국 국내외 정계의 저명인사들이 출연해왔습니다. 주중 매일 저녁 6시에 방송될 때 마다 평균적으로 약 2백만명 정도가 시청하는, 현재 미국에서 가장 영향력 있는 정치 인터뷰 프로그램 중 하나입니다.



베이어 앵커는 제3차 남북정상회담 및 9월 평양공동선언, 비핵화 관련 한미 공조 체제 등에 대해 질문했고 대통령은 10여 개의 질문에 허심탄회하게 답변했습니다. 대통령이 외신과 인터뷰 한 적은 여러번이지만 이번처럼 해외 방문 현지에서 현지 언론과 인터뷰 한 것은 처음입니다. 폭스 뉴스로서도 최초의 한국 대통령 인터뷰입니다. 문재인 대통령이 브렛 베이어 앵커와 인터뷰한 폭스 뉴스의 스페셜리포트는 미국시간으로 25일 오후 6시, 한국시간으로는 26일 오전 7시에 방송됩니다.
< ‘스페셜리포트 브렛 베이어’ Special Report with Bret Baier
http://www.foxnews.com/shows/special-report.html
 >



 브랫 베이어(Bret Baier) : 날씨 때문에 죄송한 말씀을 올립니다.
▲ 문 대통령 : 날씨가 어떻습니까?

- 브랫 베이어 :  비가 오고 있습니다.
지난번 트럼프 대통령님께서 방한하셨을 저희가 함께 한국에 갔었습니다. 굉장히 좋은 시간을 가졌습니다.
▲ 문 대통령 : 드디어 이렇게 첫 인터뷰를 하게 되어서 매우 기쁩니다.



- 브랫 베이어 : 대통령님, 이 인터뷰는 순차통역으로 진행되기 때문에 제가 질문을 드리면 통역을 해 드릴 것입니다. 인터뷰가 진행되는 동안 계속해서 마주보고 계시면 좋겠습니다.
먼저 이렇게 시간을 내주셔서 감사드립니다.
▲ 문 대통령 : 오히려 감사드립니다.



- 브랫 베이어 : 어제 트럼프 대통령께서 한미 FTA 개정 협상 서명식 전에 이렇게 말씀을 하셨습니다. 그간 북한 김정은 위원장과 좋은 진전이 있었고, 곧 2차 북미 정상회담이 있을 것으로 예상하고 있다, 그래서 대통령님께서 수 주 내로 북미 정상회담이 개최될 것으로 그렇게 예상하고 계신지요?
▲ 문 대통령 : 예, 그렇습니다. 저는 이번에 평양을 방문해서 김정은 위원장과 아주 좋은 회담을 가졌습니다. 그 회담 속에는 비핵화 문제에 관해서도 보다 진전된 합의가 있었습니다. 트럼프 대통령께서는 평양 정상회담의 결과를 아주 축하해 주셨습니다. 그리고 김정은 위원장과 보다 조기에 만나겠다는 뜻을 밝히셨습니다.



- 브랫 베이어 : 연내로 가능할 것으로 보십니까?
▲ 문 대통령 : 네, 연내도 가능하다고 생각합니다.

- 브랫 베이어 : 대통령님, 현재 미국 내에서는 일각에서 실제적인 비핵화 조치가 이루어지기 전에 우리가 너무 많은 것을 북한에 양보하는 것은 아닌지라는 우려가 존재하는 것이 사실입니다. 이에 대해서 어떻게 대응해 나가실 예정인지요?
▲ 문 대통령 : 지금까지 몇 번의 비핵화 합의가 실패를 한 적이 있었기 때문에 이번의 비핵화에 관해서도 회의적인 분들이 많이 있고, 과연 북한이 약속을 이행할 것인가라는 것을 믿지 못하는 분들이 있는 것은 사실인 것 같습니다.
그러나 이번의 비핵화 합의는 과거의 비핵화 합의와 전혀 다릅니다. 과거의 비핵화 합의는 6자회담 등 실무 차원에서 이루어졌던 그런 합의였기 때문에 언제든지 쉽게 깨어질 수 있는 그런 구조였습니다.
그러나 이번 비핵화 합의는 사상 최초로 미국의 대통령과 북한의 최고 지도자가 직접 만나서 정상회담을 통해서 합의하고, 전세계에 약속한 것입니다. 그 책임감과 구속력이 다르다고 생각합니다. 물론 저도 함께 합의를 했습니다. 그래서 이 3의 정상이 전세계 앞에 천명했던 약속이기 때문에 반드시 지켜질 것이라고 믿고, 또 그에 대해서 세 사람 모두 비핵화에 대한 의지가 아주 강합니다.
이해관계도 같습니다. 북한은 비핵화가 완료되어야만 경제 제재가 완화돼서 어려운 북한 경제를 살릴 수가 있고, 또 트럼프 대통령으로서는 이 비핵화가 완료되어야 지금까지 누구도 하지 못했던 북한의 문제를 해결하는 그런 아주 위대한 업적을 거둘 수 있게 되는 것입니다. 저로서도 북한의 비핵화가 완료돼서 경제 제재가 풀려야만 남북 간에 본격적인 경제 협력이 가능하고, 그것은 역시 또 어려움에 놓여 있는 우리 한국 경제에 새로운 활력이 될 수 있는 것입니다. 이렇기 때문에 이번의 비핵화 합의에 대해서는 반드시 이행될 것이라고 저는 확신하고 있습니다.



- 브랫 베이어 : 대통령님께서 우선순위를 두고 계신 것은 무엇인지요? 통일입니까, 아니면 비핵화입니까?
▲ 문 대통령 : 제가 가장 우선순위를 두고 있는 것은 평화입니다. 이 평화가 먼저 이루어지면 남북 간에 자유로운 왕래가 가능하고, 그것은 경제 협력으로 이어질 것이고, 그러면 한국 경제가 북한과의 경제 협력을 넘어서서 러시아, 중국, 유럽까지 북방경제로 이어지게 됩니다.
그렇게 평화가 굳어지고 나면 어느 순간엔가 통일도 자연스럽게 찾아오게 될 것입니다. 그 평화의 선결조건이 비핵화입니다. 그래서 우리는 남북 간에 완전한 평화 구축을 위해서 비핵화를 반드시 실현해야 되는 것입니다.



 브랫 베이어 : 대통령님께서 트럼프 대통령과의 관계를 어떻게 묘사하시겠습니까?
▲ 문 대통령 : 트럼프 대통령님과는 제가 작년 5월에 취임한 이후에 일곱 번의 정상회담을 가졌습니다. 그리고 스무 번 가까운 전화 통화를 했습니다. 이제 트럼프 대통령과 저와의 관계는 친구 이상의 관계가 되었다고 생각합니다. 두 사람 사이에서는 완벽한 신뢰관계가 형성되어 있습니다.
북한의 비핵화에 대해서 트럼프 대통령이 이룩한 업적을 우리가 생각하자면 작년 11월부터 오늘에 이르기까지 9개월 동안 이룬 변화를 보시면 됩니다. 작년 UN 총회에서 트럼프 대통령이 했던 연설과 오늘 트럼프 대통령이 하게 될 연설을 비교해보는 것으로도 충분히 알 수가 있습니다. 작년 11월 이후부터 북한은 일체 핵실험과 미사일 도발을 하지 않고 있습니다.
뿐만 아니라 풍계리 핵실험장을 북한은 완전히 폐기했습니다. 풍계리 핵실험장은 북한에게는 유일한 핵실험장이기 때문에 그것은 북한이 이제는 두 번 다시 핵실험을 할 수 없게 됐다는 것을 뜻합니다.
또한 이번에 평양 정상회담에서 김정은 위원장은 동창리 미사일 시험장과 미사일 발사대를 미국의 참관 하에 폐기하겠다고 약속을 했습니다. 그 폐기가 이루어지면 북한은 이제 다시 미사일을 이렇게 시험 발사하는 그 도발을 할 수 없게 되는 것입니다. 말하자면 이제는 북한이 핵과 미사일로 미국을 위협하는 일은 완전히 없어졌다고 말할 수 있습니다.
평양 정상회담에서 김정은 위원장은 더 나아가서 미국이 상응하는 조치를 취해 준다면 영변의 핵기지를 폐기하는 등 추가적인 핵 폐기 조치를 이행하겠다고 약속을 했습니다.
그렇게 북한의 비핵화 조치는 상당히 빠르게 진행되고 있고, 이 모든 것은 트럼프 대통령께서 대화를 통해서 북한 핵문제를 해결하겠다라는 아주 큰 결단을 내려준 덕분이라고 생각합니다. 오늘의 이 엄청난 변화, 70년간의 북미 간의 역사 속에서 최초로 이루어진 북미 간의 정상회담 등은 트럼프 대통령의 위대한 결단의 덕분이라고 생각하고, 저는 그 점에 대해서 트럼프 대통령에게 정말 찬사를 아끼고 싶지 않습니다.



 브랫 베이어 : 대통령님께서는 트럼프 대통령에게 많은 찬사를 이미 보내시지 않았습니까?
▲ 문 대통령 : 그렇습니다.

 브랫 베이어 : 대통령님께서는 아마도 그 누구보다 김정은 위원장과 많이 만나신 것으로 알고 있습니다. 김정은 위원장이 어떤 인물인지요? 그리고 김정은 위원장이 얼마나 진정성을 갖고 있는지 궁금합니다. 정말로 완전한 비핵화를 이룰 준비가 되어 있는지, 아니면 이 핵보유라는 것이 북한의 정체성과 직결된 문제인지, 고견을 여쭙고 싶습니다.
▲ 문 대통령 : 우선 이 말씀부터 드리고 싶습니다. 김정은 위원장도 트럼프 대통령에 대한 변함없는 신뢰와 기대를 표명하고 있습니다. 북한의 완전한 비핵화라는 어떤 위대한 역사를 만들어낼 수 있는 인물은 트럼프 대통령밖에 없다고 그렇게 믿고 있습니다. 그래서 김정은 위원장은 트럼프 대통령과 함께 트럼프 대통령의 임기 내에 북한의 완전한 비핵화를 이루고 싶다, 이런 희망을 여러 차례 표명을 하고 있습니다. 그것을 위해서 제2차 미북 정상회담의 조기 개최를 바라고 있는 것입니다.
김정은 위원장은 그동안 거듭된 핵과 미사일 도발 때문에 대체로 부정적인 이미지가 많습니다. 그래서 저는 김정은 위원장과 그동안 정상회담을 할 때마다 김정은 위원장과 보다 많은 대화를 하려고 노력했고, 또 그와 함께 김정은 위원장의 회담 모습과 대화를 나누는 모습을 TV 생중계를 통해서 우리 일반 국민들이나 전세계의 사람들이 직접 볼 수 있도록 그렇게 노력을 기울였습니다. 아마도 이제는 많은 세계인들이 저의 평가에 동의하리라고 저는 믿습니다. 김정은 위원장은 젊지만 아주 솔직 담백한 그런 인물이고, 또 비핵화에 대해서는 확고한 의지를 가지고 있는 것으로 저는 확신하고 있습니다.
뿐만 아니라 김정은 위원장은 이제는 핵을 버리고, 그 대신에 경제 발전을 통해서 북한 주민들을 더 잘살게 하겠다는 그런 전략적 마인드를 가지고 있는 인물이라고 생각합니다. 트럼프 대통령과 함께 비핵화를 이룬 후에 경제적인 도움을 받을 수 있을 것으로 그렇게 기대를 하고 있습니다.
저는 김정은 위원장이 비핵화라는 약속을 반드시 지킬 것이라고 그렇게 믿습니다.



 브랫 베이어 : 대통령님께서 완전하고 검증 가능한 비핵화를 2021년 내로 이룬다는 목표가 현실적이라고 보십니까? 짧은 기간 내에 갈 길이 아주 먼 것으로 보입니다.
▲ 문 대통령 : 일단 김정은 위원장은 이번 평양 정상회담 기간 동안 미국을 비롯한 국제사회의 참관을 말했고, 그 다음에 영구히 폐기하겠다는 뜻을 말했고, 또한 불가역적인 폐기를 말하기도 했습니다. 그래서 일단 김정은 위원장이 말하는 완전한 비핵화라는 것은 미국이 요구하는 CVID라는 것과 같은 개념이라는 것을 확인할 수 있었다는 말씀을 드리고 싶습니다.
김정은 위원장은 이미 말한 대로 핵실험장을 폐기했고, 미사일 실험장과 미사일 발사대를 폐기를 곧 하겠다고 약속했고, 그 다음에 영변 핵기지의 폐기를 상응 조처가 있을 경우에 하겠다고 약속을 했습니다.
그래서 이제 문제는 북한이 어느 정도 진지한 핵폐기 조치를 취할 경우에 그 이후에 미국이 상응하는 조치를 어느 정도 속도 있게 해 주느냐에 달려있다고 생각합니다. 미국이 속도 있는 상응 조치를 취해 준다면 북한의 비핵화 조치도 보다 속도를 낼 수 있게 될 것입니다.
이 상응 조치에 대해서 한마디 말씀을 드리자면, 이것은 싱가포르 선언에 거의 내포되어 있는 것이라고 생각합니다. 싱가포르 선언에서 북한은 비핵화와 미군 유해 송환을 약속했습니다. 그리고 그와 함께 미국은 북한에 대해서 적대관계 청산과 안전 보장, 그리고 새로운 북미관계의 수립을 약속했습니다. 이 두 가지는 일일이 ‘동시 이행’ 이렇게까지 따질 수는 없지만 크게는 병행되어 나가야 한다고 생각합니다. 북한이 비핵화 조치를 하면 할수록 미국 측에서는 북한이 핵을 내려놓더라도 북한의 체제를 보장해 줄 것이며 북미관계를 새롭게 만들어 나갈 것이다라는 믿음을 줘야 한다고 생각합니다. 또 그 믿음을 북한에 줄 수 있다면 북한은 보다 빠르게 비핵화를 해 나갈 것입니다. 그렇게만 된다면 트럼프 대통령님의 1차 임기 내에 비핵화를 마치겠다라는 북한의 어떤 타임테이블도 결코 무리하지 않다고 봅니다.



 브랫 베이어 : 대통령님께서 김정은 위원장을 신뢰하시는지요? 미국으로서는 과거 김정은 위원장이 약속을 지키지 않은 그런 전적들을 보유하고 있는 것을 잘 알고 있습니다. 미국 정부로서는 제가 알기로는, 그래서 먼저 북한이 관련 조치를 완전히 취해야 한다고 이야기하고 있는데, 지금 대통령님께서는 단계별로 제재를 풀어가면서 진행하는 것을 말씀하고 계신데, 어떻게 생각하시는지요?

▲ 문 대통령 : 우선은 상응 조치라는 것이 반드시 제재를 완화하는 것만을 뜻하는 것은 아닙니다. 우선은 종전선언을 할 수도 있고, 또는 인도적인 어떤 지원을 하는 것을 생각해 볼 수도 있고, 또는 예술단의 교류와 같은 이런 비정치적인 교류를 할 수도 있습니다.
뿐만 아니라 앞으로 영변 핵기지를 폐기하게 되면 미국 측에 장기간의 참관이 필요할 텐데, 그 참관을 위해서 평양에 연락사무소를 설치하는 것도 생각해 볼 수 있습니다. 그러면 이제는 적대관계를 청산한다는 미국의 의지도 보여주면서 참관단들이 이렇게 머물면서 활동할 수 있는 그런 근거가 될 수 있습니다.
또는 비핵화 조치가 완료되고 나면 북한의 어떤 밝은 미래, 그런 것을 미리 보여주기 위해서 예를 들면 경제시찰단을 서로 교환하는 것도 생각해 볼 수 있습니다. 반드시 제재를 완화하지 않더라도 다양한 방식으로 이제 적대관계를 청산하고, 북미관계를 새롭게 수립한다라는 것을 줄 수 있다고 생각합니다.
한 가지 분명한 것은, 이제 한국이나 미국이 이런 비핵화 협상을 함에 있어서 북한 측이 이렇게 있더라도 말하자면 전혀 손해 볼 것이 없다는 것입니다. 북한이 취해야 되는 조치들은 핵실험장을 폐기하는 것이고, 미사일 실험장을 폐기하는 것이고, 영변의 핵기지를 폐기하는 것이고, 또 다른 기지들을 폐기하는 것이고, 만들어진 핵무기를 폐기하는 것이고, 이렇게 전부 폐기하는 것입니다. 이른바 불가역적 조치를 취하는 것입니다.
그러나 그에 대해서 미국과 한국, 양국이 취하는 조치는 군사훈련을 중단하는 것, 언제든지 재기할 수 있습니다. 종전선언, 정치적 선언이기 때문에 언제든지 취소할 수 있습니다. 설령 제재를 완화하는 한이 있더라도 북한이 속일 경우, 약속을 어길 경우, 제재를 다시 강화하면 그만입니다. 그래서 북한의 비핵화 약속에 대해서 트럼프 대통령과 김정은 위원장 사이에 크게 타임테이블의 어떤 약속을 한 후에 그에 대해서 상대측의 약속을 신뢰하는 토대 위에서 이를 전개시켜 나가도 미국으로서는 손해 보는 일이 전혀 없다라는 말씀을 드리고 싶습니다.



- 브랫 베이어 : 몇 가지 만 더 질문 드리겠습니다. 마치 번개와 같이, 전광석화와 같이 한다고 저희 미국에서는 이야기합니다. 대통령님 생애 내로 통일이 이루어질 것으로 보십니까?
▲ 문 대통령 : 통일은 정말 예상할 수 없습니다. 통일은 계획대로 오지 않는다고 생각합니다. 통일은 평화가 완전해지면 어느 순간 정말 하늘에서 떨어지듯이 오는 것이라고 생각합니다. 저는 그 시기가 제 생애 내에 오기를 바라고 있습니다.

- 브랫 베이어 : 미국은 60년 넘게 주한미군이 한국에 주둔하고 있습니다. 이 주한미군이 곧 철수하기를 바라십니까?

▲ 문 대통령 : 그렇지 않습니다. 우선은 종전선언과 관련해서 종전선언이 이루어진다면 유엔사의 지위가 흔들리게 되거나 또는 주한미군이 철수해야 된다는 어떤 압박을 받는 것이 아니냐라는 의심이 일부 있었습니다. 그러나 종전선언은 지금 한국이 65년 전에 정전협정을 체결하고는 평화협정을 체결하지 못한 채 정전 상태로 65년이 흘러왔기 때문에 이제라도 적대관계를 종식하고 전쟁을 종료하겠다는 하나의 정치적 선언을 하자는 것입니다. 그리고 그것이 평화협정이 되려면 다시 평화 협상이라는 과정을 거쳐서 평화협정에 이르게 됩니다. 그리고 이 평화협정이 체결될 때까지는 정전체제가 그대로 유지가 되는 것입니다. 그래서 유엔사의 지위라든지 주한미군의 지위에는 아무런 영향이 없습니다.
뿐만 아니라 평화협정이 체결되더라도 주한미군은 전적으로 한미동맹에 의해서 결정되는 것이고, 평화협정과는 무관한 것입니다. 지금 주한미군은 남북관계에서 평화를 만들어내는 대북 억지력으로서도 큰 역할을 하지만 나아가서는 동북아 전체의 안정과 평화를 만들어내는 그런 균형자 역할을 주한미군이 하고 있습니다. 이것은 한국의 안보에 도움이 되는 것은 물론이지만, 동시에 미국의 세계전략하고도 맞닿아 있는 것입니다. 그래서 나는 평화협정이 체결되고 난 이후에도, 심지어는 남북이 통일을 이루고 난 이후에도 동북아 전체의 안정과 평화를 위해서 주한미군이 계속 주둔할 필요가 있다 그렇게 생각합니다.



- 브랫 베이어 : 질문이 짧지 않았는 데 대해서 대통령님 죄송한 말씀을 올립니다. 종전선언에 대해서 언급하셨는데, 다음 트럼프 대통령과 정상회담 때 종전선언을 서명할 수 있다고 보십니까?

▲ 문 대통령 : 일단 종전선언에 대해서 어제 트럼프 대통령과의 회담 때 충분한 논의를 했습니다. 그리고 다음 김정은 위원장과 트럼프 대통령과의 사이에 예정된 제2차 미북 정상회담에서도 저는 논의가 될 것이라고 생각합니다. 그 회담의 결과로 종전선언이 이루어질지 여부는 알 수 없지만 어쨌든 종전선언을 가급적 빠른 시일 내에, 이제는 미국과 북한 간의 적대관계를 청산한다는 하나의 상징으로서 빠른 시기에 이루어지는 것은 바람직하다라는 공감대가 대체(大體)됐다고 생각합니다.

- 브랫 베이어 : 마지막 질문입니다. 국내 비판자들에게 몇 말씀해 주셨으면 좋겠습니다. 첫 번째로는 일각에서는 대통령님께서 언론을 탄압하고 있고, 또 탈북민들을 탄압하고 있다는 그런 이야기들이 들리고 있습니다. 그래서 의사 표현의 자유를 억압하고 있다는 이야기를 제가 듣고 있는데, 이에 대해서 말씀해 주십시오.
▲ 대통령 : 아마도 한국의 역사상 지금처럼 언론의 자 유가 구가되는 그런 시기는 없었다고 생각합니다. 심지어 가짜뉴스라고 할 수 있을 정도의 그런 왜곡된 비난조차도 아무런 제재 없이 언론이나 또는 SNS 상으로 넘쳐나고 있고, 매주 주말이면 제 집무실 근처에 있는 광화문에 끊임없이 저를 비판하는 그런 집회들이 열리고 있습니다. 제가 집무하는 청와대 앞길에서도 그런 식의 집회나 농성은 끝이지 않습니다.
북한을 떠나서 우리 한국으로 찾아오는 그런 타국민들에 대해서는 우리는 언제든지 환영하고 있으며 우리 국민으로서, 또 동포로서 그렇게 대하고 있고, 또 언젠가는 그 분들이 남북통일에 있어서 하나의 마중물이나 또는 접착제 같은 역할을 할 것이라고 믿습니다.



- 브랫 베이어 : 마지막으로 한 가지만 더 여쭙겠습니다. 국내적으로 제기되고 있는 비판은 대통령께서 통일을 위해서 북한 편을 들고 있다, 이런 이야기들이 있습니다. 그래서 민주주의 원칙에 반해서 교과서에서 관련 내용들을 삭제하고, 또 트럼프 대통령님의 표현을 빌자면 이 모든 것을 페이크 뉴스라고 말씀하고 계신데, 이에 대해서 답변해 주십시오.
▲ 문 대통령 : 우선은 북한과의 어떤 관계 개선이나 통일을 지향하는 것은 역대 어느 정부나 똑같습니다. 북한과 평화통일을 이루어야 한다는 것은 우리의 헌법에 규정되어 있는 대통령의 책무이기도 합니다. 방금 그렇게 비난했던 분들은 과거 정부 시절에는 통일이 이루어진다면 그것은 그야말로 대박이고 한국 경제에 엄청난 기회가 될 것이라고 선전했던 바로 그 사람들이 이제 정권이 바뀌니까 또 정반대의 비난을 하는 것입니다.



- 브랫 베이어 : 이렇게 시간 내 주셔서 감사드립니다, 대통령님. 미국으로서는 제가 많은 사람들을 대변하고자 하는데, 이 어려운 문제를 해결하는 데 있어서 행운을 빕니다.
▲ 문 대통령 : 감사합니다. 이렇게 잘 전달해 주시기 바랍니다.







우리 대통령이셔서 감사하빈다.`,
    img: require('@/assets/38c54d6300b3.jpg')
  },
  {
    subject: 'SBS 김수민 아나운서의 과거.jpg',
    key: 8,
    id: '팝카드있으세요',
    date: '2018-09-26 17:03:16',
    reply: 21,
    content: '외모보다 마음이 더 예쁘네요'
  },
  {
    subject: '통일위해 북한 편 文대통령 "정권 바뀌니 정반대 비난"',
    key: 9,
    id: 'VBuser',
    date: '2018-09-26 11:28:34',
    reply: 22,
    content: `폭스뉴스의 정치 담당 수석 앵커인 브랫 베이어(Bret Baier)는 '대통령께서 통일을 위해서 북한 편을 들고 있다, 이런 이야기들이 있다. 민주주의 원칙에 반해서 교과서에서 관련 내용들을 삭제하고, 또 트럼프 대통령님의 표현을 빌자면 이 모든 것을 페이크 뉴스라고 말씀하고 계신데, 이에 대해서 답변해 주십시오'라고 물었다.


이에 문 대통령은 "우선은 북한과의 어떤 관계 개선이나 통일을 지향하는 것은 역대 어느 정부나 똑같다. 북한과 평화통일을 이루어야 한다는 것은 우리의 헌법에 규정되어 있는 대통령의 책무이기도 하다"라며 "방금 그렇게 비난했던 분들은 과거 정부 시절에는 통일이 이루어진다면 그것은 그야말로 대박이고 한국 경제에 엄청난 기회가 될 것이라고 선전했던 바로 그 사람들이 이제 정권이 바뀌니까 또 정반대의 비난을 하는 것"이라고 답했다. `
  },
  {
    subject: '퀄컴 "애플이 모뎀칩 기밀 빼돌려 인텔에 줬다"',
    key: 10,
    id: 'jellytwo7053',
    date: '2018-09-26 10:40:43',
    reply: 76,
    content: `퀄컴이 아이폰에 탑재된 자사 모뎀(통신)칩의 기밀 정보를 인텔 측에 제공했다며 애플에 추가로 소송을 제기했다. 애플이 영업비밀을 빼돌려 통신칩 경쟁사 인텔에 제공해 피해가 막대하다는 주장이다.



퀄컴이 24일(현지시간) 캘리포니아 상급법원에 제출한 소장에 따르면 애플은 아이폰에 탑재된 인텔 칩의 취약점 문제를 해결하기 위해 이전까지 사용해왔던 퀄컴칩의 소스코드와 로그 파일을 포함한 기밀 정보를 인텔 측 엔지니어에 제공했다는 혐의를 받고 있다.



이번 소장은 지난해 11월 퀄컴이 애플을 상대로 제기한 특허 침해 소송의 소장에 청구 항목을 더한 것이다. 퀄컴은 소장에서 "애플이 '칩셋의 세컨드 소스'를 사용해 퀄컴에 압력을 가하고 있다"며 "복원할 수 없는 피해가 예상된다"고 밝혔다.`
  },
  {
    subject: '에어팟 왼쪽만 팝니다',
    key: 11,
    id: '당신은도덕책',
    date: '2018-09-26 7:10:23',
    reply: 7,
    content: ' '
  },
  {
    subject: '노무현재단 신임 이사장에 유시민 내정(종합)',
    key: 12,
    id: '안드로이드L',
    date: '2018-09-26 14:54:30',
    reply: 23,
    content: '사진 잘나오셨네요'
  },
  {
    subject: '릴레이413일)장충기 삼성공화국과 적폐청산 그날까지!!!',
    key: 13,
    id: '설국기관차',
    date: '2018-09-26 10:09:31',
    reply: 16,
    content: `이제 클리앙 회원님들도 다음 선거까지 충성 인사 받듭시다!

이제 민주당을 중심으로 똘똘 뭉쳐서 '적폐왕 J(Jukpyewang)'를 잡읍시다!!

민주-진보성향 커뮤니티 조직적 이간질, 갈라치기 파괴공작 주력하는 커뮤니티 농단의 주범인  '적폐왕 J' 잡으러 가즈아~~!`
  }
]

const infoItems = [
  {
    subject: '엑셀, 모바일 사진 촬영만으로 스프레드시트 변환기능 발표',
    reply: 4
  },
  {
    subject: '닌텐도 스위치, 클라우드 구독 종료시 데이터 최대 6개월 보존',
    reply: 42
  },
  {
    subject: '정부, 단속 사각 HTTPS 음란사이트 접속 차단 논의',
    reply: 27
  },
  {
    subject: '루머) LG, \'V40 ThinQ\' 공식 렌더링 포착',
    reply: 9
  },
  {
    subject: 'Rtings.com 최고의 TV, 모니터, 헤드폰 리뷰 사이트',
    reply: 2
  },
  {
    subject: '루머) 구글 \'픽셀 3\' 시리즈, 카메라에 실시간 렌즈 분석 지원',
    reply: 8
  },
  {
    subject: 'Oracle, Java 11 릴리즈',
    reply: 17
  },
  {
    subject: 'Apple, macOS Mojave 10.14.1 beta 1 릴리즈',
    reply: 1
  }
]

const reviewItems = [
  {
    subject: '아이폰 메모리 리셋? 방법 미립자팁..',
    reply: 3
  },
  {
    subject: '일본식 갈라지는 오므라이스 만들기.',
    reply: 20
  },
  {
    subject: '영등포 신세계 올반 너무 짜네요',
    reply: 8
  },
  {
    subject: '화웨이 프리버드 5일 사용기',
    reply: 9
  },
  {
    subject: 'light for your moments, 필립스 휴 55개 시공 + 3주 사용기',
    reply: 13
  },
  {
    subject: '기어 -> 핏빕 -> 기어 -> 핏빕 사용기',
    reply: 15
  },
  {
    subject: '영알못이 원더풀 고스트 봤습니다. (스포多多)',
    reply: 4
  },
  {
    subject: '무료로 철학 공부 입문 및 팁?',
    reply: 20
  }
]

const sellItems = [
  {
    subject: 'USB C HUB 8-in-1'
  },
  {
    subject: '(삽니다) 티모바일 공유기 ac1900'
  },
  {
    subject: 'BMW e90 320i Lci 엔진보링완료'
  },
  {
    subject: '애플 번들 라이트닝 케이블'
  },
  {
    subject: '애플 번들 이이팟 3.5파이'
  },
  {
    subject: 'G7 SKT 블랙 가개통 팝니다'
  },
  {
    subject: '2017년형 맥북프로 13인치 기본형(논터치) 스페이스 그레이 팝니다'
  },
  {
    subject: '이케아 사무의자, 두닷 책상 판매'
  }
]

const promoteItems = [
  {
    subject: ' [스피드통신]SK/LG/KT [긴급설치가능]/[최대 95만원]/[주야상담가능]/[ai 스피커무상]'
  },
  {
    subject: '[SK/KT/LG 최고사은품 지급 ]-[ * 9월 최대 99만 ] [긴급접수][긴급입금][사후관리]'
  },
  {
    subject: '단열벽지 (a-10393) 겨울을 따뜻하게 보내세요~ ^^ 간편시공 보온 결로방지 됩니다'
  },
  {
    subject: '흩어져 있던 내보험.. 한손에 한번에 관리하는 똑똑한 앱!!'
  },
  {
    subject: '9월 롯데카드 풍성한 신규발급 혜택, 각종제휴-통신사, 항공, 포인트, 해외결제등'
  },
  {
    subject: '[9월 오토캐시백 최대 2.6%할인][신차 할부최저금리 3.3%][120개월 할부가능][신차금융'
  },
  {
    subject: '[대림케어] 제휴카드 할인, 스페셜 사은품 증정, 비데, 정수기, 연수기, 양변기+세면'
  },
  {
    subject: '[아우통신] 9월 3사 이벤트 , 최대 [74만원] [개통 당일지급] [Iot사은품 15만원][빠'
  }
]

const galleryItems = [
  {
    // url: '../../assets/1e38666606e43.jpg',
    img: require('@/assets/1e38666606e43.jpg'),
    subject: '요즘 날씨 너무 좋네요!',
    date: '10-05'
  },
  {
    // url: '../../assets/1de6675d4622b.jpg',
    img: require('@/assets/1de6675d4622b.jpg'),
    subject: '우리집 강쥐',
    date: '10-06'
  },
  {
    // url: '../../assets/1d12bc9f5ccf9.jpg',
    img: require('@/assets/1d12bc9f5ccf9.jpg'),
    subject: '미패드4 플러스 질렀습니다.',
    date: '10-07'
  },
  {
    // url: '../../assets/1da0d5a6d751a.jpg',
    img: require('@/assets/1da0d5a6d751a.jpg'),
    subject: '비오는 날 태화루',
    date: '10-08'
  }
]

const Items = {
  'recommendedItems': recommendedItems,
  'infoItems': infoItems,
  'reviewItems': reviewItems,
  'sellItems': sellItems,
  'promoteItems': promoteItems,
  'galleryItems': galleryItems
}
export default {
  getPosts (cb) {
    setTimeout(() => cb(Items), 100)
  },
  getPost (key, cb) {
    // fake an API request
    setTimeout(() => cb(null, Items.recommendedItems[key - 1]), 100)
  }
}
